
// Дано двузначное число a.Найди и выведи количество десятков в нем.

// let a = 75;
// console.log(a / 10);
// console.log(parseInt(a / 10));
// console.log(Math.floor(a / 10));


// Дано двузначное число a.Найди и выведи его последнюю цифру.

// let b = 56;
// console.log(b % 10);


// Программа получает на вход дробное число a.
// Найди и выведи первую цифру после десятичной точки.

// let a1, a2, result;
// a1 = 35.97;
// a2 = 7.45;
// result = Number.parseInt(a2 * 10 % 10);
// console.log(result);



//Посчитай количество слов( «—» не является словом).

// let a = 'int - это целочисленный тип данных';
// console.log(a.replace(" -", ""));
// console.log('Количество слов:', a.replace(" -", "").split(' ').length);




// Даны 3 строки a, b, c — фамилия, имя и отчество соответственно.
// Составь строку из инициалов данного ФИО.

// let a, b, c;
// [a, b, c] = ["Иванов", "Степан", "Александрович"];
// console.log(a, b, c);
// console.log(a[0] + "." + b[0] + "." + c[0]);
// console.log(`${a[0]}.${b[0]}.${c[0]}`);
